* DNS tables

http://dns323.kood.org/howto:ffp

#+BEGIN_SRC bash
rsync -a -v hosts dnsmasq.dmg root@192.168.1.80:/tmp/
#+END_SRC

#+RESULTS:
| sending     | incremental | file  | list     |         |       |          |           |
| dnsmasq.dmg |             |       |          |         |       |          |           |
|             |             |       |          |         |       |          |           |
| sent        | 2,813       | bytes | received |      58 | bytes | 1,914.00 | bytes/sec |
| total       | size        | is    | 6,055    | speedup | is    |     2.11 |           |

- replace hosts in /mnt/HD_a2/ffp/etc
- copy hosts to /etc
- make sure files are own by root and globally readable!
- restart


#+begin_src perl :results output :var data=machines :file hosts
  # first we need to define two functions that will make your life easier
  sub org_columns
  {
      my ($table) = @_;
      my $y = $$table[0];
      return scalar(@$y);
  }

  sub org_rows
  {
      my ($table) = @_;
      return scalar(@$table);
  }
  $COL_MACHINE= 0;
  $COL_NUMBER = 1;
  $COL_DNS    = 2;
  $COL_ALIAS  = 3;
  $COL_IP     = 4;
  $COL_MTYPE   = 5;
  $COL_LOC    = 6;
  $COL_MAC    = 7;
  $COL_NOTES  = 8;
  $COL_DHCP   = 9;
  $COL_TYPE   = 10;

  print "# automatically generated by machines.org\n\n127.0.0.1 localhost.localdomain localhost\n\n";


  for (my $row=0;$row<org_rows($data); $row++) {
    next if $$data[$row][$COL_NUMBER] eq "";
    # skip itself
    my $t = $$data[$row];
    my ($machine, $number, $dns, $alias, $xxxd, $mtype, $location, $mac, $notes, $dhcp, $type) = @$t;
    my $dns = lc($dns);
    my $alias = lc($alias);

    print "# $machine Type: [$type] MType: [$mtype] Location: $location\n";
    print "192.168.1.$number ${alias}.dmg $alias  $dns ${dns}.dmg \n\n";
  }

#+end_src

#+RESULTS:
[[file:hosts]]

